hoangdesu/BONK-game-NUC140/src/Library/NuMakerLib/Source/SYS_init.c
//
// NUC140 SYS_Init
//
#include <stdio.h>
#include "NUC100Series.h"
#include "MCU_init.h"
#include "SYS_init.h"

void SYS_Init(void)
{
    SYS_UnlockReg(); // Unlock protected registers

    // select Chip clock source & set clock source
    CLK_EnableXtalRC(MCU_CLOCK_SOURCE_MASK);    // Enable HXT external 12MHz crystal
    CLK_WaitClockReady(MCU_CLOCK_STABLE_MASK);	
    CLK_SetCoreClock(MCU_CLOCK_FREQUENCY);      // Set HCLK clock to 32MHz

    // Select IP clock source & enable module
    #ifdef MCU_INTERFACE_RTC
    CLK_EnableModuleClock(RTC_MODULE);	
    CLK_SetModuleClock(RTC_MODULE, CLK_CLKSEL2_RTC_SEL_10K_LXT, 0);	
    #endif
	
    #ifdef MCU_INTERFACE_WDT
    CLK_EnableModuleClock(WDT_MODULE);	
	    #ifdef WDT_CLOCK_SOURCE_LIRC
        CLK_SetModuleClock(WDT_MODULE, CLK_CLKSEL1_WDT_S_LIRC, 0);
	    #endif
	    #ifdef CLK_CLKSEL1_WDT_S_HCLK_DIV2048
        CLK_SetModuleClock(WDT_MODULE, CLK_CLKSEL1_WDT_S_HCLK_DIV2048, 0);	
	    #endif
	    #ifdef WDT_CLOCK_SOURCE_LXT
        CLK_SetModuleClock(WDT_MODULE, CLK_CLKSEL1_WDT_S_LXT, 0);	
			#endif
    #endif

    #ifdef MCU_INTERFACE_WWDT
    CLK_EnableModuleClock(WWDT_MODULE);	
	    #ifdef WWDT_CLOCK_SOURCE_HCLK_DIV2048
        CLK_SetModuleClock(WWDT_MODULE, CLK_CLKSEL2_WWDT_S_HCLK_DIV2048, 0);	
	    #endif		
	    #ifdef WWDT_CLOCK_SOURCE_LIRC
        CLK_SetModuleClock(WWDT_MODULE, CLK_CLKSEL2_WWDT_S_LIRC, 0);
	    #endif
    #endif
		

    #ifdef MCU_INTERFACE_TMR0
       CLK_EnableModuleClock(TMR0_MODULE);	
	     #ifdef TMR0_CLOCK_SOURCE_HXT
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_HXT, 0);
			 #endif
	     #ifdef TMR0_CLOCK_SOURCE_LXT
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_LXT, 0);
			 #endif	
			 #ifdef TMR0_CLOCK_SOURCE_HCLK
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_HCLK, 0);
			 #endif			
			 #ifdef TMR0_CLOCK_SOURCE_EXT
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_EXT_TRG, 0);
			 #endif				 
			 #ifdef TMR0_CLOCK_SOURCE_LIRC
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_LIRC, 0);
			 #endif
			 #ifdef TMR0_CLOCK_SOURCE_HIRC
			 CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0_S_HIRC, 0);
			 #endif
	  #endif

    #ifdef MCU_INTERFACE_TMR1
       CLK_EnableModuleClock(TMR1_MODULE);	
	     #ifdef TMR1_CLOCK_SOURCE_HXT
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_HXT, 0);
			 #endif
	     #ifdef TMR1_CLOCK_SOURCE_LXT
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_LXT, 0);
			 #endif	
			 #ifdef TMR1_CLOCK_SOURCE_HCLK
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_HCLK, 0);
			 #endif			
			 #ifdef TMR1_CLOCK_SOURCE_EXT
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_EXT_TRG, 0);
			 #endif				 
			 #ifdef TMR1_CLOCK_SOURCE_LIRC
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_LIRC, 0);
			 #endif
			 #ifdef TMR1_CLOCK_SOURCE_HIRC
			 CLK_SetModuleClock(TMR1_MODULE, CLK_CLKSEL1_TMR1_S_HIRC, 0);
			 #endif
	  #endif

    #ifdef MCU_INTERFACE_TMR2
       CLK_EnableModuleClock(TMR2_MODULE);	
	     #ifdef TMR2_CLOCK_SOURCE_HXT
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_HXT, 0);
			 #endif
	     #ifdef TMR2_CLOCK_SOURCE_LXT
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_LXT, 0);
			 #endif	
			 #ifdef TMR2_CLOCK_SOURCE_HCLK
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_HCLK, 0);
			 #endif			
			 #ifdef TMR2_CLOCK_SOURCE_EXT
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_EXT_TRG, 0);
			 #endif				 
			 #ifdef TMR2_CLOCK_SOURCE_LIRC
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_LIRC, 0);
			 #endif
			 #ifdef TMR2_CLOCK_SOURCE_HIRC
			 CLK_SetModuleClock(TMR2_MODULE, CLK_CLKSEL1_TMR2_S_HIRC, 0);
			 #endif
	  #endif
		
    #ifdef MCU_INTERFACE_TMR3
       CLK_EnableModuleClock(TMR3_MODULE);	
	     #ifdef TMR3_CLOCK_SOURCE_HXT
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_HXT, 0);
			 #endif
	     #ifdef TMR3_CLOCK_SOURCE_LXT
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_LXT, 0);
			 #endif	
			 #ifdef TMR3_CLOCK_SOURCE_HCLK
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_HCLK, 0);
			 #endif			
			 #ifdef TMR3_CLOCK_SOURCE_EXT
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_EXT_TRG, 0);
			 #endif				 
			 #ifdef TMR3_CLOCK_SOURCE_LIRC
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_LIRC, 0);
			 #endif
			 #ifdef TMR3_CLOCK_SOURCE_HIRC
			 CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3_S_HIRC, 0);
			 #endif
	  #endif
		
	  #ifdef MCU_INTERFACE_ADC
		   CLK_EnableModuleClock(ADC_MODULE);
			 #ifdef ADC_CLOCK_SOURCE_HXT
       CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HXT, CLK_ADC_CLK_DIVIDER(ADC_CLOCK_DIVIDER));
			 #endif
			 #ifdef ADC_CLOCK_SOURCE_LXT
       CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_LXT, CLK_ADC_CLK_DIVIDER(ADC_CLOCK_DIVIDER));
			 #endif
			 #ifdef ADC_CLOCK_SOURCE_PLL
       CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_PLL, CLK_ADC_CLK_DIVIDER(ADC_CLOCK_DIVIDER));
			 #endif
			 #ifdef ADC_CLOCK_SOURCE_HIRC
       CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HIRC,CLK_ADC_CLK_DIVIDER(ADC_CLOCK_DIVIDER));
			 #endif	
			 #ifdef ADC_CLOCK_SOURCE_HCLK
       CLK_SetModuleClock(ADC_MODULE, CLK_CLKSEL1_ADC_S_HCLK,CLK_ADC_CLK_DIVIDER(ADC_CLOCK_DIVIDER));
			 #endif
	  #endif

	  #ifdef MCU_INTERFACE_I2C0
    CLK_EnableModuleClock(I2C0_MODULE);		
	  CLK_SetModuleClock(I2C0_MODULE, 0, 0);
	  #endif
	
	  #ifdef MCU_INTERFACE_I2C1
    CLK_EnableModuleClock(I2C1_MODULE);		
	  CLK_SetModuleClock(I2C1_MODULE, 0, 0);
	  #endif
 
    #ifdef MCU_INTERFACE_PWM0
	    #ifdef PWM0_CH01_CLOCK_SOURCE_HXT
			  CLK_SetModuleClock(PWM01_MODULE, CLK_CLKSEL1_PWM01_S_HXT, 0);
			#endif
			#ifdef PWM0_CH01_CLOCK_SOURCE_LXT
			  CLK_SetModuleClock(PWM01_MODULE, CLK_CLKSEL1_PWM01_S_LXT, 0);
			#endif
			#ifdef PWM0_CH01_CLOCK_SOURCE_HCLK
			  CLK_SetModuleClock(PWM01_MODULE, CLK_CLKSEL1_PWM01_S_HCLK, 0);
			#endif
			#ifdef PWM0_CH01_CLOCK_SOURCE_HIRC
			  CLK_SetModuleClock(PWM01_MODULE, CLK_CLKSEL1_PWM01_S_HIRC, 0);
			#endif
			CLK_EnableModuleClock(PWM01_MODULE);

	    #ifdef PWM0_CH23_CLOCK_SOURCE_HXT
			  CLK_SetModuleClock(PWM23_MODULE, CLK_CLKSEL1_PWM23_S_HXT, 0);
			#endif
			#ifdef PWM0_CH23_CLOCK_SOURCE_LXT
			  CLK_SetModuleClock(PWM23_MODULE, CLK_CLKSEL1_PWM23_S_LXT, 0);
			#endif
			#ifdef PWM0_CH23_CLOCK_SOURCE_HCLK
			  CLK_SetModuleClock(PWM23_MODULE, CLK_CLKSEL1_PWM23_S_HCLK, 0);
			#endif
			#ifdef PWM0_CH23_CLOCK_SOURCE_HIRC
			  CLK_SetModuleClock(PWM23_MODULE, CLK_CLKSEL1_PWM23_S_HIRC, 0);
			#endif
			CLK_EnableModuleClock(PWM23_MODULE);
		#endif

	  #ifdef MCU_INTERFACE_PWM1
	    #ifdef PWM1_CH45_CLOCK_SOURCE_HXT
			  CLK_SetModuleClock(PWM45_MODULE, CLK_CLKSEL1_PWM45_S_HXT, 0);
			#endif
			#ifdef PWM1_CH45_CLOCK_SOURCE_LXT
			  CLK_SetModuleClock(PWM45_MODULE, CLK_CLKSEL1_PWM45_S_LXT, 0);
			#endif
			#ifdef PWM1_CH45_CLOCK_SOURCE_HCLK
			  CLK_SetModuleClock(PWM45_MODULE, CLK_CLKSEL1_PWM45_S_HCLK, 0);
			#endif
			#ifdef PWM1_CH45_CLOCK_SOURCE_HIRC
			  CLK_SetModuleClock(PWM45_MODULE, CLK_CLKSEL1_PWM45_S_HIRC, 0);
			#endif
			CLK_EnableModuleClock(PWM45_MODULE);

	    #ifdef PWM1_CH67_CLOCK_SOURCE_HXT
			  CLK_SetModuleClock(PWM67_MODULE, CLK_CLKSEL1_PWM67_S_HXT, 0);
			#endif
			#ifdef PWM1_CH67_CLOCK_SOURCE_LXT
			  CLK_SetModuleClock(PWM67_MODULE, CLK_CLKSEL1_PWM67_S_LXT, 0);
			#endif
			#ifdef PWM1_CH67_CLOCK_SOURCE_HCLK
			  CLK_SetModuleClock(PWM67_MODULE, CLK_CLKSEL1_PWM67_S_HCLK, 0);
			#endif
			#ifdef PWM1_CH67_CLOCK_SOURCE_HIRC
			  CLK_SetModuleClock(PWM67_MODULE, CLK_CLKSEL1_PWM67_S_HIRC, 0);
			#endif
			CLK_EnableModuleClock(PWM67_MODULE);
    #endif
		
