hoangdesu/BONK-game-NUC140/src/Library/NuMakerLib/Source/SYS_init.c
		#ifdef MCU_INTERFACE_UART0
		  CLK_EnableModuleClock(UART0_MODULE);
		  #ifdef UART_CLOCK_SOURCE_HXT
		  CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_HXT, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif			
			#ifdef UART_CLOCK_SOURCE_PLL
		  CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_PLL, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif
		  #ifdef UART_CLOCK_SOURCE_HIRC
		  CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif			
		#endif

		#ifdef MCU_INTERFACE_UART1
		  CLK_EnableModuleClock(UART1_MODULE);
		  #ifdef UART_CLOCK_SOURCE_HXT
		  CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART_S_HXT, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif			
			#ifdef UART_CLOCK_SOURCE_PLL
		  CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART_S_PLL, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif
		  #ifdef UART_CLOCK_SOURCE_HIRC
		  CLK_SetModuleClock(UART1_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif			
		#endif

		#ifdef MCU_INTERFACE_UART2
		  CLK_EnableModuleClock(UART2_MODULE);
		  #ifdef UART_CLOCK_SOURCE_HXT
		  CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL1_UART_S_HXT, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif		
			#ifdef UART_CLOCK_SOURCE_PLL
		  CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL1_UART_S_PLL, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif
		  #ifdef UART_CLOCK_SOURCE_HIRC
		  CLK_SetModuleClock(UART2_MODULE, CLK_CLKSEL1_UART_S_HIRC, CLK_UART_CLK_DIVIDER(UART_CLOCK_DIVIDER));
			#endif			
		#endif
		
    #ifdef MCU_INTERFACE_SPI0
      CLK_EnableModuleClock(SPI0_MODULE);
			#ifdef SPI0_CLOCK_SOURCE_PLL
      CLK_SetModuleClock(SPI0_MODULE, CLK_CLKSEL1_SPI0_S_PLL, 0);
			#endif
			#ifdef SPI0_CLOCK_SOURCE_HCLK
      CLK_SetModuleClock(SPI0_MODULE, CLK_CLKSEL1_SPI0_S_HCLK, 0);
			#endif			
		#endif 

    #ifdef MCU_INTERFACE_SPI1
      CLK_EnableModuleClock(SPI1_MODULE);
			#ifdef SPI1_CLOCK_SOURCE_PLL
      CLK_SetModuleClock(SPI1_MODULE, CLK_CLKSEL1_SPI1_S_PLL, 0);
			#endif
			#ifdef SPI1_CLOCK_SOURCE_HCLK
      CLK_SetModuleClock(SPI1_MODULE, CLK_CLKSEL1_SPI1_S_HCLK, 0);
			#endif			
		#endif 
		
    #ifdef MCU_INTERFACE_SPI2
      CLK_EnableModuleClock(SPI2_MODULE);
			#ifdef SPI2_CLOCK_SOURCE_PLL
      CLK_SetModuleClock(SPI2_MODULE, CLK_CLKSEL1_SPI2_S_PLL, 0);
			#endif
			#ifdef SPI2_CLOCK_SOURCE_HCLK
      CLK_SetModuleClock(SPI2_MODULE, CLK_CLKSEL1_SPI2_S_HCLK, 0);
			#endif			
		#endif 
		
    #ifdef MCU_INTERFACE_SPI3
      CLK_EnableModuleClock(SPI3_MODULE);
			#ifdef SPI3_CLOCK_SOURCE_HCLK
      CLK_SetModuleClock(SPI3_MODULE, CLK_CLKSEL1_SPI3_S_HCLK, 0);
			#endif			
			#ifdef SPI3_CLOCK_SOURCE_PLL
      CLK_SetModuleClock(SPI3_MODULE, CLK_CLKSEL1_SPI3_S_PLL, 0);
			#endif
		#endif 
		
		#ifdef MCU_INTERFACE_ACMP
		   CLK_EnableModuleClock(ACMP_MODULE);
		   CLK_SetModuleClock(ACMP_MODULE, 0, 0);
    #endif

    #ifdef MCU_INTERFACE_USB
		   CLK_EnableModuleClock(USBD_MODULE);		
       CLK_SetModuleClock(USBD_MODULE, 0, CLK_CLKDIV_USB(USB_CLOCK_DIVIDER));
		#endif
		
    #ifdef MCU_INTERFACE_CAN
		   CLK_EnableModuleClock(CAN0_MODULE);		
		#endif		

    #ifdef MCU_INTERFACE_CLKO		
        //CKO frequency = (Clock source frequency) / 2^(u32ClkDiv + 1);				
		    CLK_EnableModuleClock(FDIV_MODULE);
				CLK->FRQDIV = CLK_FRQDIV_DIVIDER_EN_Msk | CLKO_CLOCK_DIVIDER;
				CLK->APBCLK |= CLK_APBCLK_FDIV_EN_Msk;

				#ifdef CLK_FRQDIV_SOURCE_HXT
				CLK_SetModuleClock(FDIV_MODULE, CLK_CLKSEL2_FRQDIV_S_HXT, 0);
				#endif
				#ifdef CLK_FRQDIV_SOURCE_LXT
				CLK_SetModuleClock(FDIV_MODULE, CLK_CLKSEL2_FRQDIV_S_LXT, 0);
				#endif
				#ifdef CLK_FRQDIV_SOURCE_HCLK
				CLK_SetModuleClock(FDIV_MODULE, CLK_CLKSEL2_FRQDIV_S_HCLK, 0);
				#endif
				#ifdef CLK_FRQDIV_SOURCE_HIRC
				CLK_SetModuleClock(FDIV_MODULE, CLK_CLKSEL2_FRQDIV_S_HIRC, 0);
				#endif								
		#endif
		
    // Init I/O Multi-function 
    // Set multi-function pins for ACMP
		#ifdef PIN_ACMP0_P_PC6
		SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_GPC_MFP_PC6_Msk) | SYS_GPC_MFP_PC6_ACMP0_P;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PC6_Msk) | SYS_ALT_MFP1_PC6_ACMP0_P;
		GPIO_DISABLE_DIGITAL_PATH(PC, BIT6);
		#endif

		#ifdef PIN_ACMP0_N_PC7
		SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_GPC_MFP_PC7_Msk) | SYS_GPC_MFP_PC7_ACMP0_N;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PC7_Msk) | SYS_ALT_MFP1_PC7_ACMP0_N;
		GPIO_DISABLE_DIGITAL_PATH(PC, BIT7);
		#endif

		#ifdef PIN_ACMP1_P_PC14
		SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_GPC_MFP_PC14_Msk) | SYS_GPC_MFP_PC14_ACMP1_P;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PC14_Msk) | SYS_ALT_MFP1_PC14_ACMP1_P;
		GPIO_DISABLE_DIGITAL_PATH(PC, BIT14);
		#endif

		#ifdef PIN_ACMP1_N_PC15
		SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_GPC_MFP_PC15_Msk) | SYS_GPC_MFP_PC15_ACMP1_N;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PC15_Msk) | SYS_ALT_MFP1_PC15_ACMP1_N;
		GPIO_DISABLE_DIGITAL_PATH(PC, BIT15);
		#endif

		#ifdef PIN_ACMP0_O_PB12
		SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_GPB_MFP_PB12_Msk) | SYS_GPB_MFP_PB12_ACMP0_O;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PB12_Msk) | SYS_ALT_MFP1_PB12_ACMP0_O;
		GPIO_DISABLE_DIGITAL_PATH(PB, BIT12);
		#endif

		#ifdef PIN_ACMP1_O_PB13
		SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_GPB_MFP_PB13_Msk) | SYS_GPB_MFP_PB13_ACMP1_O;
    SYS->ALT_MFP1= (SYS->ALT_MFP1& ~SYS_ALT_MFP_PB13_Msk) | SYS_ALT_MFP1_PB13_ACMP1_O;
		GPIO_DISABLE_DIGITAL_PATH(PB, BIT13);
		#endif
		
    // Set PA multi-function pins for ADC		
	  #ifdef PIN_ADC_0
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA0_MFP_Msk) | SYS_PA_L_MFP_PA0_MFP_ADC_CH0;
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT0);
	  #endif
	  #ifdef PIN_ADC_1
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA1_MFP_Msk) | SYS_PA_L_MFP_PA1_MFP_ADC_CH1;		
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT1);
	  #endif
	  #ifdef PIN_ADC_2
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA2_MFP_Msk) | SYS_PA_L_MFP_PA2_MFP_ADC_CH2;	
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT2);
	  #endif
	  #ifdef PIN_ADC_3
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA3_MFP_Msk) | SYS_PA_L_MFP_PA3_MFP_ADC_CH3;
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT3);
	  #endif
	  #ifdef PIN_ADC_4
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA4_MFP_Msk) | SYS_PA_L_MFP_PA4_MFP_ADC_CH4;
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT4);
	  #endif
		#ifdef PIN_ADC_5
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA5_MFP_Msk) | SYS_PA_L_MFP_PA5_MFP_ADC_CH5;	
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT5);
	  #endif
		#ifdef PIN_ADC_6
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA6_MFP_Msk) | SYS_PA_L_MFP_PA6_MFP_ADC_CH6;
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT6);
	  #endif
		#ifdef PIN_ADC_7
    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA7_MFP_Msk) | SYS_PA_L_MFP_PA7_MFP_ADC_CH7;
		GPIO_DISABLE_DIGITAL_PATH(PA, BIT7);
	  #endif

    #ifdef MCU_INTERFACE_INT0_PB14
    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB14_MFP_Msk) | SYS_PB_H_MFP_PB14_MFP_EINT0;
		#endif
    #ifdef MCU_INTERFACE_INT1_PB15
    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB15_MFP_Msk) | SYS_PB_H_MFP_PB15_MFP_EINT1;
		#endif

    #ifdef MCU_INTERFACE_I2C0
     #ifdef PIN_I2C0_SCL_PA9
		 SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA9_MFP_Msk) | SYS_PA_H_MFP_PA9_MFP_I2C0_SCL;
		 #endif
		 #ifdef PIN_I2C0_SDA_PA8
		 SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA8_MFP_Msk) | SYS_PA_H_MFP_PA8_MFP_I2C0_SDA;
		 #endif
		#endif

    #ifdef MCU_INTERFACE_I2C1
     #ifdef PIN_I2C1_SCL_PA11
		 SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA11_MFP_Msk) | SYS_PA_H_MFP_PA11_MFP_I2C1_SCL;
		 #endif
		 #ifdef PIN_I2C1_SDA_PA10
		 SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA10_MFP_Msk) | SYS_PA_H_MFP_PA10_MFP_I2C1_SDA;
		 #endif
		#endif

