hoangdesu/BONK-game-NUC140/src/Library/NuMakerLib/Source/SYS_init.c
    #ifdef MCU_INTERFACE_I2S
     #ifdef PIN_I2S_LRCLK_PC0
		 SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC0_MFP_Msk) | SYS_PC_L_MFP_PC0_MFP_I2S_LRCLK;
		 #endif
		 #ifdef PIN_I2S_BCLK_PC1
		 SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC1_MFP_Msk) | SYS_PC_L_MFP_PC1_MFP_I2S_BCLK;
		 #endif
		 #ifdef PIN_I2S_DI_PC2
		 SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC2_MFP_Msk) | SYS_PC_L_MFP_PC2_MFP_I2S_DI;
		 #endif	
		 #ifdef PIN_I2S_DI_PC3
		 SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC3_MFP_Msk) | SYS_PC_L_MFP_PC3_MFP_I2S_DO;
		 #endif	
		#endif
		
		#ifdef MCU_INTERFACE_PWM0
		 #ifdef PIN_PWM0_CH0_PA12
     SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA12_MFP_Msk) | SYS_PA_H_MFP_PA12_MFP_PWM_CH0;
		 #endif
		 #ifdef PIN_PWM0_CH1_PA13
     SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA13_MFP_Msk) | SYS_PA_H_MFP_PA13_MFP_PWM_CH1;
		 #endif
		 #ifdef PIN_PWM0_CH2_PA14
     SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA14_MFP_Msk) | SYS_PA_H_MFP_PA14_MFP_PWM_CH2;
		 #endif
		 #ifdef PIN_PWM0_CH3_PA15
     SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_H_MFP_PA15_MFP_Msk) | SYS_PA_H_MFP_PA15_MFP_PWM_CH3;
		 #endif
    #endif
		
		#ifdef MCU_INTERFACE_PWM1		
		 #ifdef PIN_PWM1_CH4_PB11
     SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB11_MFP_Msk) | SYS_PB_H_MFP_PB11_MFP_PWM_CH4;
		 #endif
		 #ifdef PIN_PWM1_CH5_PE5
     SYS->GPE_MFP = (SYS->GPE_MFP & ~SYS_PE_L_MFP_PE5_MFP_Msk) | SYS_PE_L_MFP_PE5_MFP_PWM_CH5;
		 #endif
		 #ifdef PIN_PWM1_CH6_PE0
     SYS->GPE_MFP = (SYS->GPE_MFP & ~SYS_PE_L_MFP_PE0_MFP_Msk) | SYS_PE_L_MFP_PE0_MFP_PWM_CH6;
		 #endif
		 #ifdef PIN_PWM1_CH7_PE1
     SYS->GPE_MFP = (SYS->GPE_MFP & ~SYS_PE_L_MFP_PE1_MFP_Msk) | SYS_PE_L_MFP_PE1_MFP_PWM_CH7;
		 #endif	
		#endif

		#ifdef MCU_INTERFACE_UART0
		 #ifdef PIN_UART0_RX_PB0
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB0_MFP_Msk)  | SYS_PB_L_MFP_PB0_MFP_UART0_RX;
		 #endif
		 #ifdef PIN_UART0_TX_PB1
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB1_MFP_Msk)  | SYS_PB_L_MFP_PB1_MFP_UART0_TX;
		 #endif		
		 #ifdef PIN_UART0_RTS_PB2
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB2_MFP_Msk)  | SYS_PB_L_MFP_PB2_MFP_UART0_nRTS;
		 #endif
		 #ifdef PIN_UART0_CTS_PB3
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB3_MFP_Msk)  | SYS_PB_L_MFP_PB3_MFP_UART0_nCTS;
		 #endif		 
		#endif	
		
		#ifdef MCU_INTERFACE_UART1
		 #ifdef PIN_UART1_RX_PB4
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB4_MFP_Msk)  | SYS_PB_L_MFP_PB4_MFP_UART1_RX;
		 #endif
		 #ifdef PIN_UART1_TX_PB5
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB5_MFP_Msk)  | SYS_PB_L_MFP_PB5_MFP_UART1_TX;
		 #endif		
		 #ifdef PIN_UART1_RTS_PB6
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB6_MFP_Msk)  | SYS_PB_L_MFP_PB6_MFP_UART1_nRTS;
		 #endif
		 #ifdef PIN_UART1_CTS_PB7
		 SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB7_MFP_Msk)  | SYS_PB_L_MFP_PB7_MFP_UART1_nCTS;
		 #endif		 
		#endif	

		#ifdef MCU_INTERFACE_UART2
		 #ifdef PIN_UART2_RX_PD14
		 SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD14_MFP_Msk)  | SYS_PD_H_MFP_PD14_MFP_UART2_RX;
		 #endif
		 #ifdef PIN_UART2_TX_PD15
		 SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD15_MFP_Msk)  | SYS_PD_H_MFP_PD15_MFP_UART2_TX;
		 #endif				 
		#endif
		
    #ifdef MCU_INTERFACE_TMR0
		 #ifdef PIN_TC0_PB15
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB15_MFP_Msk) | SYS_GPB_MFP_PB15_TC0;
        SYS->ALT_MFP = (SYS->ALT_MFP & ~SYS_ALT_MFP_PB15_Msk)| SYS_ALT_MFP_PB15_TM0_EXT;				
		 #endif
		 #ifdef PIN_TMR0_CNT_PB8
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB8_MFP_Msk) | SYS_GPB_MFP_PB8_TM0;
		 #endif		 
		#endif
		
    #ifdef MCU_INTERFACE_TMR1
		 #ifdef PIN_TC1_PE5
		    SYS->GPE_MFP = (SYS->GPE_MFP & ~SYS_PE_L_MFP_PE5_MFP_Msk) | SYS_GPE_MFP_PE5_TC1;
        SYS->ALT_MFP = (SYS->ALT_MFP & ~SYS_ALT_MFP_PE5_Msk)| SYS_ALT_MFP_PE5_TM1_EXT;					
		 #endif		
		 #ifdef PIN_TMR1_CNT_PB9
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB9_MFP_Msk) | SYS_GPB_MFP_PB9_TM1;
		 #endif
		#endif
		
    #ifdef MCU_INTERFACE_TMR2
		 #ifdef PIN_TC2_PB2
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB2_MFP_Msk) | SYS_GPB_MFP_PB2_TC2;
        SYS->ALT_MFP = (SYS->ALT_MFP & ~SYS_ALT_MFP_PB2_Msk)| SYS_ALT_MFP_PB2_TM2_EXT;			
		 #endif		
		 #ifdef PIN_TMR2_CNT_PB10
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB10_MFP_Msk) | SYS_GPB_MFP_PB10_TM2;
		 #endif
		#endif
		
    #ifdef MCU_INTERFACE_TMR3
		 #ifdef PIN_TC3_PB3
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_L_MFP_PB3_MFP_Msk) | SYS_GPB_MFP_PB3_TC3;
				SYS->ALT_MFP = (SYS->ALT_MFP & ~SYS_ALT_MFP_PB3_Msk)| SYS_ALT_MFP_PB3_TM3_EXT;	
		 #endif			
		 #ifdef PIN_TMR3_CNT_PB11
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB11_MFP_Msk) | SYS_GPB_MFP_PB11_TM3;
		 #endif
		#endif
		
    #ifdef MCU_INTERFACE_SPI0
     #ifdef PIN_SPI0_SS1_PB10
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB10_MFP_Msk) | SYS_PB_H_MFP_PB10_MFP_SPI0_SS1;
		 #endif
     #ifdef PIN_SPI0_SS0_PC0
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC0_MFP_Msk) | SYS_PC_L_MFP_PC0_MFP_SPI0_SS0;
		 #endif
		 #ifdef PIN_SPI0_SCLK_PC1
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC1_MFP_Msk) | SYS_PC_L_MFP_PC1_MFP_SPI0_SCLK;
		 #endif
		 #ifdef PIN_SPI0_MISO0_PC2
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC2_MFP_Msk) | SYS_PC_L_MFP_PC2_MFP_SPI0_MISO0;
		 #endif
		 #ifdef PIN_SPI0_MOSI0_PC3
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC3_MFP_Msk) | SYS_PC_L_MFP_PC3_MFP_SPI0_MOSI0;
		 #endif
		 #ifdef PIN_SPI0_MISO1_PC4
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC4_MFP_Msk) | SYS_PC_L_MFP_PC4_MFP_SPI0_MISO1;
		 #endif
		 #ifdef PIN_SPI0_MOSI1_PC5
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_L_MFP_PC5_MFP_Msk) | SYS_PC_L_MFP_PC5_MFP_SPI0_MOSI1;
		 #endif
		#endif

    #ifdef MCU_INTERFACE_SPI1
      #ifdef PIN_SPI1_SS1_PB9
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB9_MFP_Msk) | SYS_PB_H_MFP_PB9_MFP_SPI1_SS1;
		  #endif
      #ifdef PIN_SPI1_SS0_PC8
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC8_MFP_Msk) | SYS_PC_H_MFP_PC8_MFP_SPI1_SS0;
		  #endif
		  #ifdef PIN_SPI1_SCLK_PC9
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC9_MFP_Msk) | SYS_PC_H_MFP_PC9_MFP_SPI1_SCLK;
		  #endif
		  #ifdef PIN_SPI1_MISO0_PC10
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC10_MFP_Msk) | SYS_PC_H_MFP_PC10_MFP_SPI1_MISO0;
		  #endif
	    #ifdef PIN_SPI1_MOSI0_PC11
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC11_MFP_Msk) | SYS_PC_H_MFP_PC11_MFP_SPI1_MOSI0;
		  #endif
		  #ifdef PIN_SPI1_MISO1_PC12
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC12_MFP_Msk) | SYS_PC_H_MFP_PC12_MFP_SPI1_MISO1;
		  #endif
		  #ifdef PIN_SPI1_MOSI1_PC13
		    SYS->GPC_MFP = (SYS->GPC_MFP & ~SYS_PC_H_MFP_PC13_MFP_Msk) | SYS_PC_H_MFP_PC13_MFP_SPI1_MOSI1;
			#endif
		#endif	
		
