hoangdesu/BONK-game-NUC140/src/Library/NuMakerLib/Source/SYS_init.c
    #ifdef MCU_INTERFACE_SPI2
      #ifdef PIN_SPI2_SS1_PA7
		    SYS->GPA_MFP = (SYS->GPA_MFP & ~SYS_PA_L_MFP_PA7_MFP_Msk) | SYS_PA_L_MFP_PA7_MFP_SPI2_SS1;
		  #endif
      #ifdef PIN_SPI2_SS0_PD0
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD0_MFP_Msk) | SYS_PD_L_MFP_PD0_MFP_SPI2_SS0;
		  #endif
		  #ifdef PIN_SPI2_SCLK_PD1
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD1_MFP_Msk) | SYS_PD_L_MFP_PD1_MFP_SPI2_SCLK;
		  #endif
		  #ifdef PIN_SPI2_MISO0_PD2
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD2_MFP_Msk) | SYS_PD_L_MFP_PD2_MFP_SPI2_MISO0;
		  #endif
	    #ifdef PIN_SPI2_MOSI0_PD3
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD3_MFP_Msk) | SYS_PD_L_MFP_PD3_MFP_SPI2_MOSI0;
		  #endif
		  #ifdef PIN_SPI2_MISO1_PD4
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD4_MFP_Msk) | SYS_PD_L_MFP_PD4_MFP_SPI2_MISO1;
		  #endif
		  #ifdef PIN_SPI2_MOSI1_PD5
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD5_MFP_Msk) | SYS_PD_L_MFP_PD5_MFP_SPI2_MOSI1;
			#endif
		#endif

    #ifdef MCU_INTERFACE_SPI3
      #ifdef PIN_SPI3_SS1_PB14
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB14_MFP_Msk) | SYS_PB_H_MFP_PB14_MFP_SPI3_SS1;
		  #endif
      #ifdef PIN_SPI3_SS0_PD8
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD8_MFP_Msk) | SYS_PD_H_MFP_PD8_MFP_SPI3_SS0;
		  #endif
		  #ifdef PIN_SPI3_SCLK_PD9
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD9_MFP_Msk) | SYS_PD_H_MFP_PD9_MFP_SPI3_SCLK;
		  #endif
		  #ifdef PIN_SPI3_MISO0_PD10
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD10_MFP_Msk) | SYS_PD_H_MFP_PD10_MFP_SPI3_MISO0;
		  #endif
	    #ifdef PIN_SPI3_MOSI0_PD11
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD11_MFP_Msk) | SYS_PD_H_MFP_PD11_MFP_SPI3_MOSI0;
		  #endif
		  #ifdef PIN_SPI3_MISO1_PD12
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD12_MFP_Msk) | SYS_PD_H_MFP_PD12_MFP_SPI3_MISO1;
		  #endif
		  #ifdef PIN_SPI3_MOSI1_PD13
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_H_MFP_PD13_MFP_Msk) | SYS_PD_H_MFP_PD13_MFP_SPI3_MOSI1;
			#endif
		#endif
		
		#ifdef PIN_CAN0_RX_PD6
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD6_MFP_Msk) | SYS_PD_L_MFP_PD6_MFP_CAN0_RX;
    #endif
		#ifdef PIN_CAN0_TX_PD7
		    SYS->GPD_MFP = (SYS->GPD_MFP & ~SYS_PD_L_MFP_PD7_MFP_Msk) | SYS_PD_L_MFP_PD7_MFP_CAN0_TX;
    #endif
		
		#ifdef PIN_CLKO_PB12
		    SYS->GPB_MFP = (SYS->GPB_MFP & ~SYS_PB_H_MFP_PB12_MFP_Msk) |SYS_GPB_MFP_PB12_CLKO;
        SYS->ALT_MFP = (SYS->ALT_MFP & ~SYS_ALT_MFP_PB12_Msk) | SYS_ALT_MFP_PB12_CLKO;
		#endif
		
    SYS_LockReg();  // Lock protected registers
}
